#  Задача 1. Вводится список целых чисел в одну строчку через пробел. Необходимо оставить в нем только двузначные числа. Реализовать программу с использованием функции filter. Результат отобразить на экране в виде последовательности оставшихся чисел в одну строчку через пробел.
# пример - 8 11 0 -23 140 1 => 11 -23

# input_num = list(map(int, input("Введите целые числа через пробел: ").split()))
# num = list(filter(lambda x: 9 < abs(x) < 100, input_num))
# print(num, end = ' ')


# Задача 2. Дан список, вывести отдельно буквы и цифры.
# Пример:
# a = ( "a", 'b', '2', '3' ,'c')
# b = ( 'a' , 'b' , 'c')
# c = ( '2', '3')

# a = ( "a", 'b', '2', '3' ,'c')
# num = list(filter(lambda x: x.isdigit(), a))
# letter = list(filter(lambda x: x.isalpha(), a))
# print(num, letter)

# Задача 3. Преобразовать набора списков users = ['user1','user2','user3','user4','user5'] ids = [4, 5, 9, 14, 7] salary = [111,222,333] в другой набор
# ['user1', 4, 111]
# ['user2', 5, 222]
# ['user3', 9, 333]
# и потом вернуть в исходное состояние
# ['user1', 'user2', 'user3']
# [4, 5, 9]
# [111, 222, 333]

# users = ['user1','user2','user3','user4','user5'] 
# ids = [4, 5, 9, 14, 7] 
# salary = [111,222,333]


# a, b, c = map(list, zip(users, ids, salary))
# print(a, b, c, sep='\n')
# print()
# a, b, c = map(list, zip(*(a, b, c)))
# print(a, b, c, sep='\n')

